[
{"id": "73495360", "title": "How can i access gstreamer udpsink on python opencv?", "content": "gst-launch-1.0 videotestsrc ! decodebin ! videoconvert ! x264enc tune=zerolatency ! rtph264pay ! udpsink host=localhost port=5000Gstreamer udpsink and udpsrc with python not working    main.py *    ...", "vote": "0", "answer": "0", "view": "7"},
{"id": "73495319", "title": "Text file incorrect tell() positions", "content": "Trying to index text file (formatted as one sentence per line) ... but the character positions seem to get skewed at some point ... in the example below this happen at line/sentence 19.First I check ...", "vote": "0", "answer": "1", "view": "30"},
{"id": "73495283", "title": "Methodology to fix 'QuerySet' object has no attribute 'Breakdown' for a Django Project", "content": "I have a workout progress project that I am working on and I am trying to find the breakdown of each exercise which is reps and order. Here is the model for clarification:class Workout(models.Model):...", "vote": "0", "answer": "1", "view": "24"},
{"id": "73495275", "title": "Using Python to get a table from a website", "content": "I have been trying to get the data from a table or object from this website. I am new to this and I have been stuck for over a week. I would like to be able to save it as and excel file or a text file....", "vote": "0", "answer": "0", "view": "23"},
{"id": "73495259", "title": "How to solve Invalid Argument Error in moddel.fit_generator", "content": "I am doing a machine learning project on Tomato leaf disease detection.Whenever I run this part of the code I am getting an InvalidArgumentError message.How to solve this?Here is my code:r = model....", "vote": "0", "answer": "0", "view": "10"},
{"id": "73495256", "title": "Why Pycharm has two site_packages (one in Lib and one outside)? and pip install issue", "content": "Idk why whenever I pip install something, I have to copy all packages and files from 'site_packages inside Lib' just to paste them in the 'site_packages' outside under External Libraries/Python to ...", "vote": "-1", "answer": "0", "view": "13"},
{"id": "73495245", "title": "How to Run a Simple Python Script non-stop 24/7", "content": "I have a simple python bot that I want to run non-stop 24/7. I haven't been able to figure out which GCP product would be best for this and how exactly I could set it up to work in this way. Any help ...", "vote": "-1", "answer": "1", "view": "23"},
{"id": "73495226", "title": "Pass labels for legend in matplotlib from a csv file", "content": "I have a csv file with a large amount of data that I am plotting as a scatter plot using pandas and matplotlib. Each data point corresponds to a different specimen I have tested. I wanted to assign ...", "vote": "0", "answer": "1", "view": "16"},
{"id": "73495215", "title": "searching text for specific information and their corresponding answers using regex", "content": "I am trying to extract answers which corresponds to certain asked information in a dialogue. For example, if someone asked about the account number, I would like to extract it from the text.text = &...", "vote": "-1", "answer": "0", "view": "27"},
{"id": "73495194", "title": "Is there a way to fix this, or is there an API for xbox gamertag API?", "content": "I am trying to make a program that generates random gamertag and checks an API to see if they are available. If the gamertag is available, it will be stored in a text file which can be accessed by the ...", "vote": "0", "answer": "0", "view": "10"},
{"id": "73495183", "title": "Python - How to write data under [ ] in json", "content": "Need to write data to [] in json file formatted like below. Able to update other values but not able to find reference to add the values under Attributes through json module in python.{    \"A&...", "vote": "0", "answer": "0", "view": "26"},
{"id": "73495180", "title": "How can I get the last item from a row in an array?", "content": "I have a CSV file that looks like this:5/15/1987   18.586/15/1987   18.867/15/1987   19.868/15/1987   18.989/15/1987   18.3110/15/1987  18.7611/15/1987  17.7812/15/1987  17.051/15/...", "vote": "-1", "answer": "2", "view": "36"},
{"id": "73495154", "title": "Please is there a way I can solve this error I think everything is well with this", "content": "I have suffered from this error, please help me.this is my views.py and models.py file please I need to create add to cart function, and this error one happens when I click the add to cart button ...", "vote": "0", "answer": "0", "view": "23"},
{"id": "73495132", "title": "jupyter notebook not working in vs code kernelspec, zmq", "content": "using jupyter nbotebook with vs code and throws the dll problemwith zqm library", "vote": "0", "answer": "1", "view": "7"},
{"id": "73495124", "title": "Eigenvector with the largest eigenvalue", "content": "In Python, I use eig() from numpy.linalg to get the eigenvectors and eigenvalues of a matrix. Then, I use max() to get the largest eigenvalue. How can I find the corresponding eigenvector of this ...", "vote": "0", "answer": "1", "view": "13"},
{"id": "73495118", "title": "Download file from webpage using Mechanical soup", "content": "I am currently running around Mechanical soup, because comparing to standart \"browser\" in Beautiful soup it's significantly faster. But I am currently facing issue or more like , question ...", "vote": "0", "answer": "0", "view": "20"},
{"id": "73495111", "title": "Grouping a dataframe and conserving the same number of rows", "content": "I'm trying to make the kind of transformation shown in the image below :I made the code below but unfortunately I'm not getting the result I'm looking for:import pandas as pddf = pd.DataFrame({'...", "vote": "0", "answer": "2", "view": "13"},
{"id": "73495101", "title": "Python What's the best practices to INSERT INTO many data tables to SQL Server simultaneously using pyodbc", "content": "I have many Excel data tables read as dataframe using Python Pandas. I set up five different python scripts to INSERT these data rows INTO a SQL server (cloud) simultaneously using pyodbc. Will this ...", "vote": "-1", "answer": "0", "view": "16"},
{"id": "73495100", "title": "remove all rows with the values in all column similar with another pyspark dataframe", "content": "For example, if i have 2 pyspark dataframe with 100++ columns.I wish to compare dataframe A, with Dataframe B and check whether is there row with similar values based on all 100++columns. If yes, ...", "vote": "0", "answer": "0", "view": "13"},
{"id": "73495095", "title": "Shapes(rectangle,diamond) detection using OpenCV library", "content": "I have two connected rectangles with a diamond in between them. In Entity Relationship Diagram (ERD) we have the same scenario. My aim is to detect both the rectangles and the diamond which is in ...", "vote": "0", "answer": "0", "view": "17"},
{"id": "73495094", "title": "Finding text in html with seluim and bs4", "content": "Hello im trying very hard to make a webscraping bot to retive my grades every hour i have already coded the part where it logs in to the website but i cant figure out how to extract just the grade ...", "vote": "0", "answer": "0", "view": "10"},
{"id": "73495092", "title": "Notion, update code block with API destroys formatting and can't get it back", "content": "I'm trying to update a mermaid code block in Notion using the API. I can patch the text fine, but when it patches, I lose all of the formatting of key words associated with mermaid. Everything turns ...", "vote": "0", "answer": "0", "view": "9"},
{"id": "73495080", "title": "Is there a python character input field that doesen't wait for the user to type something? [duplicate]", "content": "I'm trying to create a game in python that will run in the terminal on my Linux computer but if i use getkey() or input() then it will wait for the user to type something then run the code after it. I ...", "vote": "0", "answer": "0", "view": "15"},
{"id": "73495076", "title": "Get latest numerically date in directory", "content": "I am new to python and I am trying to copy files in the last directory into a newly created directory. the directory is set up as recording\\202208\\20220824 and I want to get data/files from the latest ...", "vote": "0", "answer": "0", "view": "10"},
{"id": "73495064", "title": "python.exe: No module named pyinstaller", "content": "It doesn't matter what I do, I just cannot use this to create an executable of a .py script.It's plain useless.If not, then I'd like a video to prove it.If someone can make this happen that would ...", "vote": "-3", "answer": "1", "view": "21"},
{"id": "73495061", "title": "How do I add a list to a column in pandas?", "content": "I'm trying to merge the columns kw1, kw2, kw3 shown here:and have it in one separate column called keywords. This is what I tried:df['keywords'] = list((df['kw1'], df['kw2'], df['kw3']))dfbut I'...", "vote": "1", "answer": "1", "view": "25"},
{"id": "73495048", "title": "Why the menubar is not showing in my tkinter application?", "content": "Here is the code:# -*- coding: utf-8 -*-import tkinter as tk\rclass Application(tk.Tk):    def __init__(self):        super(self.__class__, self).__init__()        self.title('test')        ...", "vote": "0", "answer": "1", "view": "17"},
{"id": "73495042", "title": "How to access Firestore database object globally in FastAPI", "content": "I am using Firestore as my database with FastAPI. I am able to connect to the database as such:#NOTE: Everything shown below is importedcred = credentials.Certificate(\"path_to_file.json\") ...", "vote": "-1", "answer": "0", "view": "8"},
{"id": "73495009", "title": "Python Update Value in one Line?", "content": "In python I have:c_f = None#c_f may change hereif not c_f:    c_f = new_c_fCan I write last 2 lines in one line?If I want to keep first non-None valueIf I want to keep last non-None value\r...", "vote": "0", "answer": "0", "view": "21"},
{"id": "73495006", "title": "python3.0 winrm powershell script start-process can not start process", "content": "use python3.10  winrm to run powershell script remotely, the start-process command can not start tsm.exe  process, is some wrong in below code? could someone help me to check this ,thank youip_item='...", "vote": "0", "answer": "0", "view": "8"},
{"id": "73494992", "title": "How can you publish HTML/PDF from Jupyter notebook without annoying outputs", "content": "I want to publish an HTML (preferably) or PDF from a Jupyter notebook, however when I export from Visual Studio Code it also outputs some annoying text that I do not want for certain cells, alongside ...", "vote": "0", "answer": "0", "view": "12"},
{"id": "73494991", "title": "How is the frequency basis chosen for 2d fourier transform in numpy?", "content": "I'm converting 2D (spatial) images to that of the frequency domain using tf.signal.fft2d (in numpy: np.fft.fft2) and notice that the start and end shapes are the same, although I don't see why they ...", "vote": "0", "answer": "0", "view": "9"},
{"id": "73494965", "title": "Environmental variable is causing issue when using singularity to run docker container on supercomputer", "content": "I am running a very simple docker container but have to run it in singularity.  Every single time I run the image...singularity --exec --cleanenv dcm2bids.sif dcm2bids $ARGI get an error telling me ...", "vote": "0", "answer": "0", "view": "10"},
{"id": "73494954", "title": "Single Line Calculator", "content": "Make a calculator that can solve this in a single line (5+5-4+55-5*6/2)nums = list(input(\"Write a mathematical Expression: \"))print(nums)total = 0for i in range(len(nums)-1):  if ...", "vote": "1", "answer": "1", "view": "37"},
{"id": "73494951", "title": "In Python, kick off an async function and return early", "content": "I have a function in python that should kick off an asynchronous 'slow' function, and return before that 'slow' function completes.async def doSomethingSlowButReturnQuickly():  asyncio.create_task(...", "vote": "0", "answer": "1", "view": "20"},
{"id": "73494928", "title": "How to convert data to series in Python?", "content": "here is some background:I am trying to use scipy.integrate.solve_ivp to run a simulation.One of the parameters, t_eval, needs to be loaded from a .csv file. I have done this as follows:filename = '...", "vote": "1", "answer": "0", "view": "20"},
{"id": "73494896", "title": "Python: Sort data frame by column value", "content": "I have a data frame that looks something like this:  ID Ah Am  RAs  Ed Em  DEs   Vmag    U-B    B-V    V-I    e_    e_    e_    e_ _ _ _ _ mb n_ 2MASS   1 10 42 57.6 -59 47 22.6 18.681         1.105 ...", "vote": "-1", "answer": "0", "view": "16"},
{"id": "73494859", "title": "Use only while and assignment to truncate a list of numbers?", "content": "I've been asked (or challenged) by a friend (just taking some Python course) about this interesting question: given a list of numbers, you can only use - 1) while-loop, and 2) assignment to truncation ...", "vote": "-2", "answer": "2", "view": "22"},
{"id": "73494841", "title": "Pandas.map returning Categorical dtype when it should be integer", "content": "So, it's great I can use a dict of a pd.Series as a way to map from one domain to another.  However, I've just discovered something very off (tempted to say Pandas bug) where the returned type of the ...", "vote": "0", "answer": "0", "view": "13"},
{"id": "73494830", "title": "How to make tkinter app python responding to windows scaling size?", "content": "'''I want to make tkinter app python responding to windows scaling size. I'm using 'grid' method.My gui application doesn't respond to change in windows scaling.This the correct image of appThis is ...", "vote": "-1", "answer": "0", "view": "20"},
{"id": "73494820", "title": "Algorithm which finds the count of values are smaller to the right than the current one (in the list) [closed]", "content": "I have to solve the task which finds the count of values, are smaller than the current one, located to the right.Here is the example:# We have listlist = [5, 4, 3, 2, 1]First answer is 4, because ...", "vote": "0", "answer": "0", "view": "44"},
{"id": "73494819", "title": "loop through a matrix using map() python", "content": "I want to loop through a matrix and compare each element in the row with the rest values of the row (itself) without using for loop :)for example:x= [[1,3], [4,5]]if the number x[i][j] is < than ...", "vote": "0", "answer": "0", "view": "18"},
{"id": "73494776", "title": "I want to draw line in pyqt after I press on left mouse button then I release it and then I can draw line to right or left .. top or down", "content": "I am new in pyqt and I make simple painter program that draw lines and rectangles and it is fine, but I want to start drawing line after I click on left mouse button and then I release it and the line ...", "vote": "-1", "answer": "0", "view": "29"},
{"id": "73494763", "title": "Getting the maximum date based on another column", "content": "Title is a bit confusing, let us see a simple example. I have a dataframe df_1 that looks like this: my_id    series          date     cat_1   cat_2      val_1         val_2     100         1    ...", "vote": "0", "answer": "0", "view": "13"},
{"id": "73494760", "title": "PyGame adding pixel to object", "content": "Is it possible to create an object in PyGame (example, a rect) and add individual pixels or coordinates to it? For example, passing a list of pixel coordinates to a rect to alter the size.", "vote": "0", "answer": "0", "view": "21"},
{"id": "73494756", "title": "AWS Cognito: Get Access_token from url fragment after successful login (Python)", "content": "After going through countless documentation, articles, and videos, I am still lost on how I ultimately use AWS Cognito access keys in order to verify a user is logged in (after logging in and moving ...", "vote": "0", "answer": "0", "view": "11"},
{"id": "73494753", "title": "SHA256 Personal Implementation Is Only Returning The Correct Hash Value For Input Messages With A Block Size That Doesn't Exceed 512 Bits", "content": "For a while I've been working on my own implementation of the SHA256 in Python to entertain my interest in mathematics and programming.The problem I'm currently struggling with is that my ...", "vote": "0", "answer": "1", "view": "18"},
{"id": "73494732", "title": "Python QWebEngineView.setStyleSheet", "content": "I'm currently working with PyQt5 and PyQtWebEngine and I want to create a small map in the form of a circle.I tried to add setStyleSheet but it didn't give good results.This is what I want to get :...", "vote": "0", "answer": "0", "view": "11"},
{"id": "73494717", "title": "Trying to play multiple frequencies in python sounddevice blow horrific speaker sounds and an error message saying \"alsa underrun occurred\"", "content": "I tried different ways to play sine waves in sounddevice, and they worked fine, until I tried to overlay multiple frequencies at once. I also get loud scratching noises in my speaker whenever there ...", "vote": "0", "answer": "1", "view": "14"},
{"id": "73494713", "title": "How to convert nested dictionaries to dataframes in the below format in python", "content": "I have a dictionary like this:dict = {Student_ID_1:{Course_1:[12,45,378], Course_2: [33,78,345]},        Student_ID_2:{Course_6:[15,25,48], Course_24: [31,38,342]},        ....<truncated>........", "vote": "2", "answer": "3", "view": "38"}
]